{
    "response": {
        "requestType": 3,
        "elements": [
            {
                "elementIdentifier": "03.08",
                "elementTypeIdentifier": "family",
                "title": "Media Protection",
                "text": "",
                "elements": [
                    {
                        "elementIdentifier": "03.08.01",
                        "elementTypeIdentifier": "requirement",
                        "title": "Media Storage",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.08.01",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "System media include digital and non-digital media. Digital media include diskettes, flash drives, magnetic tapes, external or removable solid state or magnetic drives, compact discs, and digital versatile discs. Non-digital media include paper and microfilm. Physically controlling stored media includes conducting inventories, establishing procedures to allow individuals to check out and return media to libraries, and maintaining accountability for stored media. Secure storage includes a locked drawer, desk, or cabinet or a controlled media library. Controlled areas provide physical and procedural controls to meet the requirements established for protecting information and systems. Sanitization techniques (e.g., destroying, cryptographically erasing, clearing, and purging) prevent the disclosure of CUI to unauthorized individuals. The sanitization process removes CUI from media such that the information cannot be retrieved or reconstructed."
                            },
                            {
                                "elementIdentifier": "E-03.08.01",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: physical protection policy and procedures; media protection policy and procedures; procedures for media storage; access control policy and procedures; system media; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.08.01",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with system media protection and storage responsibilities; personnel with information security responsibilities]"
                            },
                            {
                                "elementIdentifier": "SP 800-111",
                                "elementTypeIdentifier": "reference",
                                "title": "Scarfone KA, Souppaya MP, Sexton M (2007) Guide to Storage Encryption Technologies for End User Devices. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (S",
                                "text": "https://doi.org/10.6028/NIST.SP.800-111"
                            },
                            {
                                "elementIdentifier": "SP 800-88",
                                "elementTypeIdentifier": "reference",
                                "title": "Kissel RL, Regenscheid AR, Scholl MA, Stine KM (2014) Guidelines for Media Sanitization. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-88, Rev. ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-88r1"
                            },
                            {
                                "elementIdentifier": "SR-03.08.01",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Physically control and securely store system media that contain CUI.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.08.01[01]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "system media that contain CUI are physically controlled."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.08.01[02]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "system media that contain CUI are securely stored."
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.08.01",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for storing information media; mechanisms for supporting or implementing secure media storage/media protection]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.8.1",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199049,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "MP-04",
                                "elementTypeIdentifier": "control",
                                "child_title": "MEDIA STORAGE",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.08.02",
                        "elementTypeIdentifier": "requirement",
                        "title": "Media Access",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.08.02",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "System media include digital and non-digital media. Access to CUI on system media can be restricted by physically controlling such media. This includes conducting inventories, ensuring that procedures are in place to allow individuals to check out and return media to the media library, and maintaining accountability for stored media. For digital media, access to CUI can be restricted by using cryptographic means. Encrypting data in storage or at rest is addressed in <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.13.08\">03.13.08</a>."
                            },
                            {
                                "elementIdentifier": "E-03.08.02",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: physical protection policy and procedures; media protection policy and procedures; procedures for media access restrictions; access control policy and procedures; media storage facilities; access control records; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.08.02",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with system media protection responsibilities; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-111",
                                "elementTypeIdentifier": "reference",
                                "title": "Scarfone KA, Souppaya MP, Sexton M (2007) Guide to Storage Encryption Technologies for End User Devices. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (S",
                                "text": "https://doi.org/10.6028/NIST.SP.800-111"
                            },
                            {
                                "elementIdentifier": "SR-03.08.02",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Restrict access to CUI on system media to authorized personnel or roles.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.08.02",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "access to CUI on system media is restricted to authorized personnel or roles."
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.08.02",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for restricting information on media; mechanisms for supporting or implementing media access restrictions]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.8.2",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199050,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "MP-02",
                                "elementTypeIdentifier": "control",
                                "child_title": "MEDIA ACCESS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.08.03",
                        "elementTypeIdentifier": "requirement",
                        "title": "Media Sanitization",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.08.03",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Media sanitization applies to digital and non-digital media that are subject to disposal or reuse, whether or not the media are considered removable. Examples include digital media in scanners, copiers, printers, notebook computers, mobile devices, workstations, network components, and non-digital media. The sanitization process removes CUI from media such that the information cannot be retrieved or reconstructed. Sanitization techniques (e.g., cryptographically erasing, clearing, purging, and destroying) prevent the disclosure of CUI to unauthorized individuals when such media are reused or released for disposal. NARA policies control the sanitization process for media that contain CUI and may require destruction when other methods cannot be applied to the media."
                            },
                            {
                                "elementIdentifier": "E-03.08.03",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: media protection policy and procedures; procedures for media sanitization and disposal; applicable standards and policies that address media sanitization policy; system audit records; media sanitization records; system design documentation; system configuration settings; records retention and disposition policy; records retention and disposition procedures; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.08.03",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with media sanitization responsibilities; personnel with records retention and disposition responsibilities; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-88",
                                "elementTypeIdentifier": "reference",
                                "title": "Kissel RL, Regenscheid AR, Scholl MA, Stine KM (2014) Guidelines for Media Sanitization. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-88, Rev. ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-88r1"
                            },
                            {
                                "elementIdentifier": "SR-03.08.03",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Sanitize system media that contain CUI prior to disposal, release out of organizational control, or release for reuse.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.08.03",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "system media that contain CUI are sanitized prior to disposal, release out of organizational control, or release for reuse."
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.08.03",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for media sanitization; mechanisms for supporting or implementing media sanitization]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.8.3",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199051,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "MP-06",
                                "elementTypeIdentifier": "control",
                                "child_title": "MEDIA SANITIZATION",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.08.04",
                        "elementTypeIdentifier": "requirement",
                        "title": "Media Marking",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.08.04",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "System media include digital and non-digital media. Marking refers to the use or application of human-readable security attributes. Labeling refers to the use of security attributes for internal system data structures. Digital media include diskettes, magnetic tapes, external or removable solid state or magnetic drives, flash drives, compact discs, and digital versatile discs. Non-digital media include paper and microfilm. CUI is defined by NARA along with marking, safeguarding, and dissemination requirements for such information."
                            },
                            {
                                "elementIdentifier": "E-03.08.04",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: physical protection policy and procedures; media protection policy and procedures; procedures for media marking; list of system media marking security attributes; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.08.04",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with system media protection and marking responsibilities; personnel with information security responsibilities]"
                            },
                            {
                                "elementIdentifier": "SR-03.08.04",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Mark system media that contain CUI to indicate distribution limitations, handling caveats, and applicable CUI markings.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.08.04[01]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "system media that contain CUI are marked to indicate distribution limitations."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.08.04[02]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "system media that contain CUI are marked to indicate handling caveats."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.08.04[03]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "system media that contain CUI are marked to indicate applicable CUI markings."
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.08.04",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for marking information media; mechanisms for supporting or implementing media marking]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.8.4",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199052,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "MP-03",
                                "elementTypeIdentifier": "control",
                                "child_title": "MEDIA MARKING",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.08.05",
                        "elementTypeIdentifier": "requirement",
                        "title": "Media Transport",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.08.05",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "System media include digital and non-digital media. Digital media include flash drives, diskettes, magnetic tapes, external or removable solid state or magnetic drives, compact discs, and digital versatile discs. Non-digital media include microfilm and paper. Controlled areas are spaces for which organizations provide physical or procedural measures to meet the requirements established for protecting CUI and systems. Media protection during transport can include cryptography and/or locked containers. Activities associated with media transport include releasing media for transport, ensuring that media enter the appropriate transport processes, and the actual transport. Authorized transport and courier personnel may include individuals external to the organization. Maintaining accountability of media during transport includes restricting transport activities to authorized personnel and tracking or obtaining the records of transport activities as the media move through the transportation system to prevent and detect loss, destruction, or tampering. This requirement is related to <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.13.08\">03.13.08</a> and <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.13.11\">03.13.11</a>."
                            },
                            {
                                "elementIdentifier": "E-03.08.05",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: physical protection policy and procedures; media protection policy and procedures; procedures for media storage; access control policy and procedures; authorized personnel list; system media; designated controlled areas; system and communications protection policy and procedures; cryptographic mechanisms and configuration documentation; procedures for the protection of information at rest; system design documentation; system configuration settings; list of information at rest requiring confidentiality protections; system audit records; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.08.05",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with system media protection and storage responsibilities; personnel with information security responsibilities; system developers; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-111",
                                "elementTypeIdentifier": "reference",
                                "title": "Scarfone KA, Souppaya MP, Sexton M (2007) Guide to Storage Encryption Technologies for End User Devices. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (S",
                                "text": "https://doi.org/10.6028/NIST.SP.800-111"
                            },
                            {
                                "elementIdentifier": "SR-03.08.05",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.08.05.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Protect and control system media that contain CUI during transport outside of controlled areas.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.05.a[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system media that contain CUI are protected during transport outside of controlled areas."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.08.05.a[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system media that contain CUI are controlled during transport outside of controlled areas."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.08.05.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Maintain accountability of system media that contain CUI during transport outside of controlled areas.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.05.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "accountability for system media that contain CUI is maintained during transport outside of controlled areas."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.08.05.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Document activities associated with the transport of system media that contain CUI.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.05.c",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "activities associated with the transport of system media that contain CUI are documented."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.08.05",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for storing information media; mechanisms for supporting or implementing media storage/media protection; mechanisms for supporting or implementing confidentiality protections for information at rest]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.8.5",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199053,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "MP-05",
                                "elementTypeIdentifier": "control",
                                "child_title": "MEDIA TRANSPORT",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "SC-28",
                                "elementTypeIdentifier": "control",
                                "child_title": "PROTECTION OF INFORMATION AT REST",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.08.06",
                        "elementTypeIdentifier": "requirement",
                        "title": "",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "WR-03.08.06",
                                "elementTypeIdentifier": "withdraw_reason",
                                "title": "",
                                "text": "Incorporated into 03.13.08.",
                                "elements": [
                                    {
                                        "elementIdentifier": "03.13.08",
                                        "elementTypeIdentifier": "requirement",
                                        "title": "Transmission and Storage Confidentiality",
                                        "text": "",
                                        "relationIdentifier": "incorporated_into"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.08.07",
                        "elementTypeIdentifier": "requirement",
                        "title": "Media Use",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.08.07",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "In contrast to requirement <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.08.01\">03.08.01</a>, which restricts user access to media, this requirement restricts or prohibits the use of certain types of media, such as external hard drives, flash drives, or smart displays. Organizations can use technical and non-technical measures (e.g., policies, procedures, and rules of behavior) to control the use of system media. For example, organizations may control the use of portable storage devices by using physical cages on workstations to prohibit access to external ports or disabling or removing the ability to insert, read, or write to devices. Organizations may limit the use of portable storage devices to only approved devices, including devices provided by the organization, devices provided by other approved organizations, and devices that are not personally owned. Organizations may also control the use of portable storage devices based on the type of device — prohibiting the use of writeable, portable devices — and implement this restriction by disabling or removing the capability to write to such devices. Limits on the use of organization-controlled system media in external systems include restrictions on how the media may be used and under what conditions. Requiring identifiable owners (e.g., individuals, organizations, or projects) for removable system media reduces the risk of using such technologies by allowing organizations to assign responsibility and accountability for addressing known vulnerabilities in the media (e.g., insertion of malicious code)."
                            },
                            {
                                "elementIdentifier": "E-03.08.07",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: system media protection policy and procedures; system use policy; procedures for media usage restrictions; rules of behavior; system audit records; system design documentation; system configuration settings; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.08.07",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with system media use responsibilities; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-111",
                                "elementTypeIdentifier": "reference",
                                "title": "Scarfone KA, Souppaya MP, Sexton M (2007) Guide to Storage Encryption Technologies for End User Devices. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (S",
                                "text": "https://doi.org/10.6028/NIST.SP.800-111"
                            },
                            {
                                "elementIdentifier": "SR-03.08.07",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.08.07.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Restrict or prohibit the use of [Assignment: organization-defined types of system media].",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.07.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the use of the following types of system media is restricted or prohibited: <A.03.08.07.ODP[01]: types of system media>.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.08.07.ODP[01]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "types of system media",
                                                        "text": "types of system media with usage restrictions or that are prohibited from use are defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.08.07.odp[01]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined types of system media"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.08.07.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Prohibit the use of removable system media without an identifiable owner.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.07.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the use of removable system media without an identifiable owner is prohibited."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.08.07",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for media use; mechanisms for restricting or prohibiting the use of system media on systems or system components]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.8.7",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199054,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "MP-07",
                                "elementTypeIdentifier": "control",
                                "child_title": "MEDIA USE",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.08.08",
                        "elementTypeIdentifier": "requirement",
                        "title": "",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "WR-03.08.08",
                                "elementTypeIdentifier": "withdraw_reason",
                                "title": "",
                                "text": "Incorporated into 03.08.07.",
                                "elements": [
                                    {
                                        "elementIdentifier": "03.08.07",
                                        "elementTypeIdentifier": "requirement",
                                        "title": "Media Use",
                                        "text": "",
                                        "relationIdentifier": "incorporated_into"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.08.09",
                        "elementTypeIdentifier": "requirement",
                        "title": "System Backup – Cryptographic Protection",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.08.09",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "The selection of cryptographic mechanisms is based on the need to protect the confidentiality of backup information. Hardware security module (HSM) devices safeguard and manage cryptographic keys and provide cryptographic processing. Cryptographic operations (e.g., encryption, decryption, and signature generation and verification) are typically hosted on the HSM device, and many implementations provide hardware-accelerated mechanisms for cryptographic operations. This requirement is related to <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.13.11\">03.13.11</a>."
                            },
                            {
                                "elementIdentifier": "E-03.08.09",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: contingency planning policy and procedures; procedures for system backup; contingency plan; system design documentation; system configuration settings; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.08.09",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with system backup responsibilities; personnel with information security responsibilities]"
                            },
                            {
                                "elementIdentifier": "SP 800-130",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Smid ME, Branstad DK, Chokhani S (2013) A Framework for Designing Cryptographic Key Management Systems. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-130"
                            },
                            {
                                "elementIdentifier": "SP 800-152",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Branstad DK, Smid ME (2015) A Profile for U.S. Federal Cryptographic Key Management Systems (CKMS). (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publicat",
                                "text": "https://doi.org/10.6028/NIST.SP.800-152"
                            },
                            {
                                "elementIdentifier": "SP 800-34",
                                "elementTypeIdentifier": "reference",
                                "title": "Swanson MA, Bowen P, Phillips AW, Gallup D, Lynes D (2010) Contingency Planning Guide for Federal Information Systems. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-34r1"
                            },
                            {
                                "elementIdentifier": "SR-03.08.09",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.08.09.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Protect the confidentiality of backup information.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.09.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the confidentiality of backup information is protected."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.08.09.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Implement cryptographic mechanisms to prevent the unauthorized disclosure of CUI at backup storage locations.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.09.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "cryptographic mechanisms are implemented to prevent the unauthorized disclosure of CUI at backup storage locations."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.08.09",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for supporting or implementing the cryptographic protection of backup information]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.8.9",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199055,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "CP-09",
                                "elementTypeIdentifier": "control",
                                "child_title": "SYSTEM BACKUP",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "CP-09(08)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "CRYPTOGRAPHIC PROTECTION",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}