{
    "response": {
        "requestType": 3,
        "elements": [
            {
                "elementIdentifier": "03.01",
                "elementTypeIdentifier": "family",
                "title": "Access Control",
                "text": "",
                "elements": [
                    {
                        "elementIdentifier": "03.01.03",
                        "elementTypeIdentifier": "requirement",
                        "title": "Information Flow Enforcement",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.03",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Information flow control regulates where CUI can transit within a system and between systems (in contrast to who is allowed to access the information) and without regard to subsequent accesses to that information. Flow control restrictions include keeping CUI from being transmitted in the clear to the internet, blocking external communications traffic that claims to be sourced from within the organization, restricting requests to the internet that are not from the internal web proxy server, and limiting CUI transfers between organizations based on data structures and content. Transferring CUI between organizations may require an agreement that specifies how the information flow is enforced (see <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.12.05\">03.12.05</a>). Transferring CUI between systems that represent different security domains with different security policies introduces the risk that such transfers violate one or more domain security policies. In such situations, information owners or stewards provide guidance at designated policy enforcement points between interconnected systems. Organizations consider mandating specific architectural solutions when required to enforce specific security policies. Enforcement includes prohibiting CUI transfers between interconnected systems (i.e., allowing information access only), employing hardware mechanisms to enforce one-way information flows, and implementing trustworthy regrading mechanisms to reassign security attributes and security labels. Organizations commonly use information flow control policies and enforcement mechanisms to control the flow of CUI between designated sources and destinations (e.g., networks, individuals, and devices) within systems and between interconnected systems. Flow control is based on characteristics of the information or the information path. Enforcement occurs in boundary protection devices (e.g., encrypted tunnels, routers, gateways, and firewalls) that use rule sets or establish configuration settings that restrict system services, provide a packet-filtering capability based on header information, or provide a message-filtering capability based on message content (e.g., implementing key word searches or using document characteristics). Organizations also consider the trustworthiness of filtering and inspection mechanisms (i.e., hardware, firmware, and software components) that are critical to information flow enforcement."
                            },
                            {
                                "elementIdentifier": "E-03.01.03",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; information flow control policies; procedures for information flow enforcement; security architecture and design documentation; system configuration settings; system baseline configuration; system audit records; list of information flow authorizations; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.03",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: system administrators; personnel with security architecture responsibilities; personnel with information security responsibilities; system developers]"
                            },
                            {
                                "elementIdentifier": "SP 800-160-1",
                                "elementTypeIdentifier": "reference",
                                "title": "Ross R, Winstead M, McEvilley M (2022) Engineering Trustworthy Secure Systems. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-160, Vol. 1, Rev. 1",
                                "text": "https://doi.org/10.6028/NIST.SP.800-160v1r1"
                            },
                            {
                                "elementIdentifier": "SP 800-162",
                                "elementTypeIdentifier": "reference",
                                "title": "Hu VC, Ferraiolo DF, Kuhn R, Schnitzer A, Sandlin K, Miller R, Scarfone KA (2014) Guide to Attribute Based Access Control (ABAC) Definition and Considerations. (National Institute of Standards and Tec",
                                "text": "https://doi.org/10.6028/NIST.SP.800-162"
                            },
                            {
                                "elementIdentifier": "SP 800-178",
                                "elementTypeIdentifier": "reference",
                                "title": "Ferraiolo DF, Hu VC, Kuhn R, Chandramouli R (2016) A Comparison of Attribute Based Access Control (ABAC) Standards for Data Service Applications: Extensible Access Control Markup Language (XACML) and ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-178"
                            },
                            {
                                "elementIdentifier": "SR-03.01.03",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Enforce approved authorizations for controlling the flow of CUI within the system and between connected systems.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.01.03[01]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "approved authorizations are enforced for controlling the flow of CUI within the system."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.01.03[02]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "approved authorizations are enforced for controlling the flow of CUI between connected systems."
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.03",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing the information flow enforcement policy]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.3",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 198999,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-04",
                                "elementTypeIdentifier": "control",
                                "child_title": "INFORMATION FLOW ENFORCEMENT",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}