{
    "response": {
        "requestType": 3,
        "elements": [
            {
                "elementIdentifier": "03.14",
                "elementTypeIdentifier": "family",
                "title": "System and Information Integrity",
                "text": "",
                "elements": [
                    {
                        "elementIdentifier": "03.14.08",
                        "elementTypeIdentifier": "requirement",
                        "title": "Information Management and Retention",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.14.08",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Federal agencies consider data retention requirements for nonfederal organizations. Retaining CUI on nonfederal systems after contracts or agreements have concluded increases the attack surface for those systems and the risk of the information being compromised. NARA provides federal policy and guidance on records retention and schedules."
                            },
                            {
                                "elementIdentifier": "E-03.14.08",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: system and information integrity policy and procedures; laws, Executive Orders, directives, policies, regulations, standards, and operational requirements applicable to information management and retention; records retention and disposition policy; records retention and disposition procedures; media protection policy; media protection procedures; audit findings; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.14.08",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with information and records management, retention, and disposition responsibilities; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SR-03.14.08",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Manage and retain CUI within the system and CUI output from the system in accordance with applicable laws, Executive Orders, directives, regulations, policies, standards, guidelines, and operational requirements.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.14.08[01]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "CUI within the system is managed in accordance with applicable laws, Executive Orders, directives, regulations, policies, standards, guidelines, and operational requirements."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.14.08[02]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "CUI within the system is retained in accordance with applicable laws, Executive Orders, directives, regulations, policies, standards, guidelines, and operational requirements."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.14.08[03]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "CUI output from the system is managed in accordance with applicable laws, Executive Orders, directives, regulations, policies, standards, guidelines, and operational requirements."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.14.08[04]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "CUI output from the system is retained in accordance with applicable laws, Executive Orders, directives, regulations, policies, standards, guidelines, and operational requirements."
                                    }
                                ],
                                "externalRelationships": [
                                    {
                                        "elementIdentifier": "DCH-18",
                                        "relationIdentifier": "olir_focal",
                                        "olirEntryElementId": 213195,
                                        "shortName": "SCF",
                                        "frameworkVersionIdentifier": "SCF2024.4_2024_4",
                                        "elementTypeIdentifier": "x",
                                        "title": "y",
                                        "text": "z",
                                        "olirName": "a"
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.14.08",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for information management, retention, and disposition; mechanisms for supporting or implementing information management, retention, and disposition]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "SI-12",
                                "elementTypeIdentifier": "control",
                                "child_title": "INFORMATION MANAGEMENT AND RETENTION",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}