{
    "response": {
        "requestType": 3,
        "elements": [
            {
                "elementIdentifier": "03.08",
                "elementTypeIdentifier": "family",
                "title": "Media Protection",
                "text": "",
                "elements": [
                    {
                        "elementIdentifier": "03.08.05",
                        "elementTypeIdentifier": "requirement",
                        "title": "Media Transport",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.08.05",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "System media include digital and non-digital media. Digital media include flash drives, diskettes, magnetic tapes, external or removable solid state or magnetic drives, compact discs, and digital versatile discs. Non-digital media include microfilm and paper. Controlled areas are spaces for which organizations provide physical or procedural measures to meet the requirements established for protecting CUI and systems. Media protection during transport can include cryptography and/or locked containers. Activities associated with media transport include releasing media for transport, ensuring that media enter the appropriate transport processes, and the actual transport. Authorized transport and courier personnel may include individuals external to the organization. Maintaining accountability of media during transport includes restricting transport activities to authorized personnel and tracking or obtaining the records of transport activities as the media move through the transportation system to prevent and detect loss, destruction, or tampering. This requirement is related to <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.13.08\">03.13.08</a> and <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.13.11\">03.13.11</a>."
                            },
                            {
                                "elementIdentifier": "E-03.08.05",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: physical protection policy and procedures; media protection policy and procedures; procedures for media storage; access control policy and procedures; authorized personnel list; system media; designated controlled areas; system and communications protection policy and procedures; cryptographic mechanisms and configuration documentation; procedures for the protection of information at rest; system design documentation; system configuration settings; list of information at rest requiring confidentiality protections; system audit records; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.08.05",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with system media protection and storage responsibilities; personnel with information security responsibilities; system developers; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-111",
                                "elementTypeIdentifier": "reference",
                                "title": "Scarfone KA, Souppaya MP, Sexton M (2007) Guide to Storage Encryption Technologies for End User Devices. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (S",
                                "text": "https://doi.org/10.6028/NIST.SP.800-111"
                            },
                            {
                                "elementIdentifier": "SR-03.08.05",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.08.05.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Protect and control system media that contain CUI during transport outside of controlled areas.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.05.a[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system media that contain CUI are protected during transport outside of controlled areas."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.08.05.a[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system media that contain CUI are controlled during transport outside of controlled areas."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.08.05.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Maintain accountability of system media that contain CUI during transport outside of controlled areas.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.05.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "accountability for system media that contain CUI is maintained during transport outside of controlled areas."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.08.05.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Document activities associated with the transport of system media that contain CUI.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.08.05.c",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "activities associated with the transport of system media that contain CUI are documented."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.08.05",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for storing information media; mechanisms for supporting or implementing media storage/media protection; mechanisms for supporting or implementing confidentiality protections for information at rest]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.8.5",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199053,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "MP-05",
                                "elementTypeIdentifier": "control",
                                "child_title": "MEDIA TRANSPORT",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "SC-28",
                                "elementTypeIdentifier": "control",
                                "child_title": "PROTECTION OF INFORMATION AT REST",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}