{
    "response": {
        "requestType": 3,
        "elements": [
            {
                "elementIdentifier": "03.04",
                "elementTypeIdentifier": "family",
                "title": "Configuration Management",
                "text": "",
                "elements": [
                    {
                        "elementIdentifier": "03.04.02",
                        "elementTypeIdentifier": "requirement",
                        "title": "Configuration Settings",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.04.02",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Configuration settings are the set of parameters that can be changed in hardware, software, or firmware components of the system and that affect the security posture or functionality of the system. Security-related configuration settings can be defined for systems (e.g., servers, workstations), input and output devices (e.g., scanners, copiers, printers), network components (e.g., firewalls, routers, gateways, voice and data switches, wireless access points, network appliances, sensors), operating systems, middleware, and applications. Security parameters are those parameters that impact the security state of the system, including the parameters required to satisfy other security requirements. Security parameters include registry settings; account, file, and directory permission settings (i.e., privileges); and settings for functions, ports, protocols, and remote connections. Organizations establish organization-wide configuration settings and subsequently derive specific configuration settings for the system. The established settings become part of the system’s configuration baseline. Common secure configurations (also referred to as security configuration checklists, lockdown and hardening guides, security reference guides, and security technical implementation guides) provide recognized, standardized, and established benchmarks that stipulate secure configuration settings for specific information technology platforms/products and instructions for configuring those system components to meet operational requirements. Common secure configurations can be developed by a variety of organizations, including information technology product developers, manufacturers, vendors, consortia, academia, industry, federal agencies, and other organizations in the public and private sectors."
                            },
                            {
                                "elementIdentifier": "E-03.04.02",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: configuration management policy and procedures; procedures for system configuration settings; configuration management plan; system design documentation; system configuration settings; common secure configuration checklists; system component inventory; evidence supporting approved deviations from established configuration settings; change control records; system data processing and retention permissions; system audit records; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.04.02",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with security configuration management responsibilities; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-126",
                                "elementTypeIdentifier": "reference",
                                "title": "Waltermire DA, Quinn SD, Booth H, III, Scarfone KA, Prisaca D (2018) The Technical Specification for the Security Content Automation Protocol (SCAP): SCAP Version 1.3. (National Institute of Standards",
                                "text": "https://doi.org/10.6028/NIST.SP.800-126r3"
                            },
                            {
                                "elementIdentifier": "SP 800-128",
                                "elementTypeIdentifier": "reference",
                                "title": "Johnson LA, Dempsey KL, Ross RS, Gupta S, Bailey D (2011) Guide for Security-Focused Configuration Management of Information Systems. (National Institute of Standards and Technology, Gaithersburg, MD)",
                                "text": "https://doi.org/10.6028/NIST.SP.800-128"
                            },
                            {
                                "elementIdentifier": "SP 800-70",
                                "elementTypeIdentifier": "reference",
                                "title": "Quinn SD, Souppaya MP, Cook MR, Scarfone KA (2018) National Checklist Program for IT Products: Guidelines for Checklist Users and Developers. (National Institute of Standards and Technology, Gaithersb",
                                "text": "https://doi.org/10.6028/NIST.SP.800-70r4"
                            },
                            {
                                "elementIdentifier": "SR-03.04.02",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.04.02.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Establish, document, and implement the following configuration settings for the system that reflect the most restrictive mode consistent with operational requirements: [Assignment: organization-defined configuration settings].",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.04.02.a[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the following configuration settings for the system that reflect the most restrictive mode consistent with operational requirements are established and documented: <A.03.04.02.ODP[01]: configuration settings>.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.04.02.ODP[01]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "configuration settings",
                                                        "text": "configuration settings for the system that reflect the most restrictive mode consistent with operational requirements are defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.04.02.odp[01]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined configuration settings"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.04.02.a[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the following configuration settings for the system are implemented: <A.03.04.02.ODP[01]: configuration settings>."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.04.02.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Identify, document, and approve any deviations from established configuration settings.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.04.02.b[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "any deviations from established configuration settings are identified and documented."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.04.02.b[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "any deviations from established configuration settings are approved."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.04.02",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for managing configuration settings; mechanisms that implement, monitor, or control system configuration settings; mechanisms that identify or document deviations from established configuration settings]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.4.2",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199024,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "CM-06",
                                "elementTypeIdentifier": "control",
                                "child_title": "CONFIGURATION SETTINGS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}