{
    "response": {
        "requestType": 3,
        "elements": [
            {
                "elementIdentifier": "03.01",
                "elementTypeIdentifier": "family",
                "title": "Access Control",
                "text": "",
                "elements": [
                    {
                        "elementIdentifier": "03.01.01",
                        "elementTypeIdentifier": "requirement",
                        "title": "Account Management",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.01",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "This requirement focuses on account management for systems and applications. The definition and enforcement of access authorizations other than those determined by account type (e.g., privileged access, non-privileged access) are addressed in <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.01.02\">03.01.02</a>. System account types include individual, group, temporary, system, guest, anonymous, emergency, developer, and service. Users who require administrative privileges on system accounts receive additional scrutiny by personnel responsible for approving such accounts and privileged access. Types of accounts that organizations may prohibit due to increased risk include group, emergency, guest, anonymous, and temporary. Organizations may choose to define access privileges or other attributes by account, type of account, or a combination of both. Other attributes required for authorizing access include restrictions on the time of day, day of the week, and point of origin. When defining other system account attributes, organizations consider system requirements (e.g., system upgrades, scheduled maintenance) and mission and business requirements (e.g., time zone differences, remote access to facilitate travel requirements). Users who pose a significant security risk include individuals for whom reliable evidence indicates either the intention to use authorized access to the system to cause harm or that adversaries will cause harm through them. Close coordination among mission and business owners, system administrators, human resource managers, and legal staff is essential when disabling system accounts for high-risk individuals. Time periods for the notification of organizational personnel or roles may vary. Inactivity logout is behavior- or policy-based and requires users to take physical action to log out when they are expecting inactivity longer than the defined period. Automatic enforcement of inactivity logout is addressed by <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.01.10\">03.01.10</a>."
                            },
                            {
                                "elementIdentifier": "E-03.01.01",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; personnel termination or transfer policies and procedures; procedures for account management; list of active system accounts and the name of the individual associated with each account; system design documentation; list of conditions for group and role membership; system configuration settings; notifications of recent transfers, separations, or terminations of employees; list of recently disabled system accounts and the name of the individual associated with each account; list of user activities that pose significant organizational risks; access authorization records; account management compliance reviews; system monitoring and audit records; system security plan; system-generated list of accounts removed; system-generated list of emergency accounts disabled; system-generated list of disabled accounts; other relevant documents and records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.01",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with account management responsibilities; system administrators; personnel with information security responsibilities; system developers]"
                            },
                            {
                                "elementIdentifier": "IR 7874",
                                "elementTypeIdentifier": "reference",
                                "title": "Hu VC, Scarfone KA (2012) Guidelines for Access Control System Evaluation Metrics. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Interagency or Internal Report (IR) 7874.",
                                "text": "https://doi.org/10.6028/NIST.IR.7874"
                            },
                            {
                                "elementIdentifier": "IR 7966",
                                "elementTypeIdentifier": "reference",
                                "title": "Ylonen T, Turner P, Scarfone KA, Souppaya MP (2015) Security of Interactive and Automated Access Management Using Secure Shell (SSH). (National Institute of Standards and Technology, Gaithersburg, MD)",
                                "text": "https://doi.org/10.6028/NIST.IR.7966"
                            },
                            {
                                "elementIdentifier": "SP 800-113",
                                "elementTypeIdentifier": "reference",
                                "title": "Frankel SE, Hoffman P, Orebaugh AD, Park R (2008) Guide to SSL VPNs. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-113.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-113"
                            },
                            {
                                "elementIdentifier": "SP 800-114",
                                "elementTypeIdentifier": "reference",
                                "title": "Souppaya MP, Scarfone KA (2016) User’s Guide to Telework and Bring Your Own Device (BYOD) Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 80",
                                "text": "https://doi.org/10.6028/NIST.SP.800-114r1"
                            },
                            {
                                "elementIdentifier": "SP 800-121",
                                "elementTypeIdentifier": "reference",
                                "title": "Padgette J, Bahr J, Holtmann M, Batra M, Chen L, Smithbey R, Scarfone KA (2017) Guide to Bluetooth Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publicatio",
                                "text": "https://doi.org/10.6028/NIST.SP.800-121r2-upd1"
                            },
                            {
                                "elementIdentifier": "SP 800-162",
                                "elementTypeIdentifier": "reference",
                                "title": "Hu VC, Ferraiolo DF, Kuhn R, Schnitzer A, Sandlin K, Miller R, Scarfone KA (2014) Guide to Attribute Based Access Control (ABAC) Definition and Considerations. (National Institute of Standards and Tec",
                                "text": "https://doi.org/10.6028/NIST.SP.800-162"
                            },
                            {
                                "elementIdentifier": "SP 800-178",
                                "elementTypeIdentifier": "reference",
                                "title": "Ferraiolo DF, Hu VC, Kuhn R, Chandramouli R (2016) A Comparison of Attribute Based Access Control (ABAC) Standards for Data Service Applications: Extensible Access Control Markup Language (XACML) and ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-178"
                            },
                            {
                                "elementIdentifier": "SP 800-192",
                                "elementTypeIdentifier": "reference",
                                "title": "Yaga DJ, Kuhn R, Hu VC (2017) Verification and Test Methods for Access Control Policies/Models. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-19",
                                "text": "https://doi.org/10.6028/NIST.SP.800-192"
                            },
                            {
                                "elementIdentifier": "SP 800-46",
                                "elementTypeIdentifier": "reference",
                                "title": "Souppaya MP, Scarfone KA (2016) Guide to Enterprise Telework, Remote Access, and Bring Your Own Device (BYOD) Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special",
                                "text": "https://doi.org/10.6028/NIST.SP.800-46r2"
                            },
                            {
                                "elementIdentifier": "SP 800-57-1",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB (2020) Recommendation for Key Management: Part 1 – General. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-57 Part 1, Rev. 5.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-57pt1r5"
                            },
                            {
                                "elementIdentifier": "SP 800-57-2",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Barker WC (2019) Recommendation for Key Management: Part 2 – Best Practices for Key Management Organizations. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Specia",
                                "text": "https://doi.org/10.6028/NIST.SP.800-57pt2r1"
                            },
                            {
                                "elementIdentifier": "SP 800-57-3",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Dang QH (2015) Recommendation for Key Management, Part 3: Application-Specific Key Management Guidance. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-57pt3r1"
                            },
                            {
                                "elementIdentifier": "SP 800-77",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Dang QH, Frankel SE, Scarfone KA, Wouters P (2020) Guide to IPsec VPNs. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-77, Rev. 1.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-77r1"
                            },
                            {
                                "elementIdentifier": "SR-03.01.01",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.01.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Define the types of system accounts allowed and prohibited.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.a[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system account types allowed are defined."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.a[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system account types prohibited are defined."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.01.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Create, enable, modify, disable, and remove system accounts in accordance with policy, procedures, prerequisites, and criteria.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.b[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system accounts are created in accordance with organizational policy, procedures, prerequisites, and criteria."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.b[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system accounts are enabled in accordance with organizational policy, procedures, prerequisites, and criteria."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.b[03]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system accounts are modified in accordance with organizational policy, procedures, prerequisites, and criteria."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.b[04]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system accounts are disabled in accordance with organizational policy, procedures, prerequisites, and criteria."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.b[05]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system accounts are removed in accordance with organizational policy, procedures, prerequisites, and criteria."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.01.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Specify:",
                                        "elements": [
                                            {
                                                "elementIdentifier": "SR-03.01.01.c.01",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "01",
                                                "text": "Authorized users of the system,",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.c.01",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "authorized users of the system are specified."
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.c.02",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "02",
                                                "text": "Group and role membership, and",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.c.02",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "group and role memberships are specified."
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.c.03",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "03",
                                                "text": "Access authorizations (i.e., privileges) for each account.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.c.03",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "access authorizations (i.e., privileges) for each account are specified."
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.01.d",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "d",
                                        "text": "Authorize access to the system based on:",
                                        "elements": [
                                            {
                                                "elementIdentifier": "SR-03.01.01.d.01",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "01",
                                                "text": "A valid access authorization and",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.d.01",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "access to the system is authorized based on a valid access authorization."
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.d.02",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "02",
                                                "text": "Intended system usage.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.d.02",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "access to the system is authorized based on intended system usage."
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.01.e",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "e",
                                        "text": "Monitor the use of system accounts.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.e",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the use of system accounts is monitored."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.01.f",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "f",
                                        "text": "Disable system accounts when:",
                                        "elements": [
                                            {
                                                "elementIdentifier": "SR-03.01.01.f.01",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "01",
                                                "text": "The accounts have expired,",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.f.01",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "system accounts are disabled when the accounts have expired."
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.f.02",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "02",
                                                "text": "The accounts have been inactive for [Assignment: organization-defined time period],",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.f.02",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "system accounts are disabled when the accounts have been inactive for <A.03.01.01.ODP[01]: time period>.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "A.03.01.01.ODP[01]",
                                                                "elementTypeIdentifier": "odp",
                                                                "title": "time period",
                                                                "text": "the time period for account inactivity before disabling is defined.",
                                                                "elements": [
                                                                    {
                                                                        "elementIdentifier": "OS-a.03.01.01.odp[01]",
                                                                        "elementTypeIdentifier": "odp_statement",
                                                                        "title": "",
                                                                        "text": "organization-defined time period"
                                                                    },
                                                                    {
                                                                        "elementIdentifier": "single_entry",
                                                                        "elementTypeIdentifier": "odp_type",
                                                                        "title": "Assignment",
                                                                        "text": ""
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.f.03",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "03",
                                                "text": "The accounts are no longer associated with a user or individual,",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.f.03",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "system accounts are disabled when the accounts are no longer associated with a user or individual."
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.f.04",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "04",
                                                "text": "The accounts are in violation of organizational policy, or",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.f.04",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "system accounts are disabled when the accounts violate organizational policy."
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.f.05",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "05",
                                                "text": "Significant risks associated with individuals are discovered.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.f.05",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "system accounts are disabled when significant risks associated with individuals are discovered."
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.01.g",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "g",
                                        "text": "Notify account managers and designated personnel or roles within:",
                                        "elements": [
                                            {
                                                "elementIdentifier": "SR-03.01.01.g.01",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "01",
                                                "text": "[Assignment: organization-defined time period] when accounts are no longer required.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.g.01",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "account managers and designated personnel or roles are notified within <A.03.01.01.ODP[02]: time period> when accounts are no longer required.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "A.03.01.01.ODP[02]",
                                                                "elementTypeIdentifier": "odp",
                                                                "title": "time period",
                                                                "text": "the time period within which to notify account managers and designated personnel or roles when accounts are no longer required is defined.",
                                                                "elements": [
                                                                    {
                                                                        "elementIdentifier": "OS-a.03.01.01.odp[02]",
                                                                        "elementTypeIdentifier": "odp_statement",
                                                                        "title": "",
                                                                        "text": "organization-defined time period"
                                                                    },
                                                                    {
                                                                        "elementIdentifier": "single_entry",
                                                                        "elementTypeIdentifier": "odp_type",
                                                                        "title": "Assignment",
                                                                        "text": ""
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.g.02",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "02",
                                                "text": "[Assignment: organization-defined time period] when users are terminated or transferred.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.g.02",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "account managers and designated personnel or roles are notified within <A.03.01.01.ODP[03]: time period> when users are terminated or transferred.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "A.03.01.01.ODP[03]",
                                                                "elementTypeIdentifier": "odp",
                                                                "title": "time period",
                                                                "text": "the time period within which to notify account managers and designated personnel or roles when users are terminated or transferred is defined.",
                                                                "elements": [
                                                                    {
                                                                        "elementIdentifier": "OS-a.03.01.01.odp[03]",
                                                                        "elementTypeIdentifier": "odp_statement",
                                                                        "title": "",
                                                                        "text": "organization-defined time period"
                                                                    },
                                                                    {
                                                                        "elementIdentifier": "single_entry",
                                                                        "elementTypeIdentifier": "odp_type",
                                                                        "title": "Assignment",
                                                                        "text": ""
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.01.g.03",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "03",
                                                "text": "[Assignment: organization-defined time period] when system usage or the need-to-know changes for an individual.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.01.g.03",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "account managers and designated personnel or roles are notified within <A.03.01.01.ODP[04]: time period> when system usage or the need-to-know changes for an individual.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "A.03.01.01.ODP[04]",
                                                                "elementTypeIdentifier": "odp",
                                                                "title": "time period",
                                                                "text": "the time period within which to notify account managers and designated personnel or roles when system usage or the need-to-know changes for an individual is defined.",
                                                                "elements": [
                                                                    {
                                                                        "elementIdentifier": "OS-a.03.01.01.odp[04]",
                                                                        "elementTypeIdentifier": "odp_statement",
                                                                        "title": "",
                                                                        "text": "organization-defined time period"
                                                                    },
                                                                    {
                                                                        "elementIdentifier": "single_entry",
                                                                        "elementTypeIdentifier": "odp_type",
                                                                        "title": "Assignment",
                                                                        "text": ""
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.01.h",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "h",
                                        "text": "Require that users log out of the system after [Assignment: organization-defined time period] of expected inactivity or when [Assignment: organization-defined circumstances].",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.01.h",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "users are required to log out of the system after <A.03.01.01.ODP[05]: time period> of expected inactivity or when the following circumstances occur: <A.03.01.01.ODP[06]: circumstances>.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.01.ODP[05]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "time period",
                                                        "text": "the time period of expected inactivity requiring users to log out of the system is defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.01.odp[05]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined time period"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "elementIdentifier": "A.03.01.01.ODP[06]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "circumstances",
                                                        "text": "circumstances requiring users to log out of the system are defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.01.odp[06]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined circumstances"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.01",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: processes for account management on the system; mechanisms for implementing account management]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.1",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 198997,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-02",
                                "elementTypeIdentifier": "control",
                                "child_title": "ACCOUNT MANAGEMENT",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-02(03)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "DISABLE ACCOUNTS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-02(05)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "INACTIVITY LOGOUT",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-02(13)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "DISABLE ACCOUNTS FOR HIGH-RISK INDIVIDUALS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.02",
                        "elementTypeIdentifier": "requirement",
                        "title": "Access Enforcement",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.02",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Access control policies control access between active entities or subjects (i.e., users or system processes acting on behalf of users) and passive entities or objects (i.e., devices, files, records, domains) in organizational systems. Types of system access include remote access and access to systems that communicate through external networks, such as the internet. Access enforcement mechanisms can also be employed at the application and service levels to provide increased protection for CUI. This recognizes that the system can host many applications and services in support of mission and business functions. Access control policies are defined in <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.15.01\">03.15.01</a>."
                            },
                            {
                                "elementIdentifier": "E-03.01.02",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for access enforcement; system design documentation; system configuration settings; list of approved authorizations (i.e., user privileges); system audit records; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.02",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with access enforcement responsibilities; system administrators; personnel with information security responsibilities; system developers]"
                            },
                            {
                                "elementIdentifier": "IR 7874",
                                "elementTypeIdentifier": "reference",
                                "title": "Hu VC, Scarfone KA (2012) Guidelines for Access Control System Evaluation Metrics. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Interagency or Internal Report (IR) 7874.",
                                "text": "https://doi.org/10.6028/NIST.IR.7874"
                            },
                            {
                                "elementIdentifier": "IR 7966",
                                "elementTypeIdentifier": "reference",
                                "title": "Ylonen T, Turner P, Scarfone KA, Souppaya MP (2015) Security of Interactive and Automated Access Management Using Secure Shell (SSH). (National Institute of Standards and Technology, Gaithersburg, MD)",
                                "text": "https://doi.org/10.6028/NIST.IR.7966"
                            },
                            {
                                "elementIdentifier": "SP 800-113",
                                "elementTypeIdentifier": "reference",
                                "title": "Frankel SE, Hoffman P, Orebaugh AD, Park R (2008) Guide to SSL VPNs. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-113.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-113"
                            },
                            {
                                "elementIdentifier": "SP 800-114",
                                "elementTypeIdentifier": "reference",
                                "title": "Souppaya MP, Scarfone KA (2016) User’s Guide to Telework and Bring Your Own Device (BYOD) Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 80",
                                "text": "https://doi.org/10.6028/NIST.SP.800-114r1"
                            },
                            {
                                "elementIdentifier": "SP 800-121",
                                "elementTypeIdentifier": "reference",
                                "title": "Padgette J, Bahr J, Holtmann M, Batra M, Chen L, Smithbey R, Scarfone KA (2017) Guide to Bluetooth Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publicatio",
                                "text": "https://doi.org/10.6028/NIST.SP.800-121r2-upd1"
                            },
                            {
                                "elementIdentifier": "SP 800-162",
                                "elementTypeIdentifier": "reference",
                                "title": "Hu VC, Ferraiolo DF, Kuhn R, Schnitzer A, Sandlin K, Miller R, Scarfone KA (2014) Guide to Attribute Based Access Control (ABAC) Definition and Considerations. (National Institute of Standards and Tec",
                                "text": "https://doi.org/10.6028/NIST.SP.800-162"
                            },
                            {
                                "elementIdentifier": "SP 800-178",
                                "elementTypeIdentifier": "reference",
                                "title": "Ferraiolo DF, Hu VC, Kuhn R, Chandramouli R (2016) A Comparison of Attribute Based Access Control (ABAC) Standards for Data Service Applications: Extensible Access Control Markup Language (XACML) and ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-178"
                            },
                            {
                                "elementIdentifier": "SP 800-192",
                                "elementTypeIdentifier": "reference",
                                "title": "Yaga DJ, Kuhn R, Hu VC (2017) Verification and Test Methods for Access Control Policies/Models. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-19",
                                "text": "https://doi.org/10.6028/NIST.SP.800-192"
                            },
                            {
                                "elementIdentifier": "SP 800-46",
                                "elementTypeIdentifier": "reference",
                                "title": "Souppaya MP, Scarfone KA (2016) Guide to Enterprise Telework, Remote Access, and Bring Your Own Device (BYOD) Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special",
                                "text": "https://doi.org/10.6028/NIST.SP.800-46r2"
                            },
                            {
                                "elementIdentifier": "SP 800-57-1",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB (2020) Recommendation for Key Management: Part 1 – General. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-57 Part 1, Rev. 5.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-57pt1r5"
                            },
                            {
                                "elementIdentifier": "SP 800-57-2",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Barker WC (2019) Recommendation for Key Management: Part 2 – Best Practices for Key Management Organizations. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Specia",
                                "text": "https://doi.org/10.6028/NIST.SP.800-57pt2r1"
                            },
                            {
                                "elementIdentifier": "SP 800-57-3",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Dang QH (2015) Recommendation for Key Management, Part 3: Application-Specific Key Management Guidance. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-57pt3r1"
                            },
                            {
                                "elementIdentifier": "SP 800-77",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Dang QH, Frankel SE, Scarfone KA, Wouters P (2020) Guide to IPsec VPNs. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-77, Rev. 1.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-77r1"
                            },
                            {
                                "elementIdentifier": "SR-03.01.02",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Enforce approved authorizations for logical access to CUI and system resources in accordance with applicable access control policies.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.01.02[01]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "approved authorizations for logical access to CUI are enforced in accordance with applicable access control policies."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.01.02[02]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "approved authorizations for logical access to system resources are enforced in accordance with applicable access control policies."
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.02",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing the access control policy]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.2",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 198998,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-03",
                                "elementTypeIdentifier": "control",
                                "child_title": "ACCESS ENFORCEMENT",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.03",
                        "elementTypeIdentifier": "requirement",
                        "title": "Information Flow Enforcement",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.03",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Information flow control regulates where CUI can transit within a system and between systems (in contrast to who is allowed to access the information) and without regard to subsequent accesses to that information. Flow control restrictions include keeping CUI from being transmitted in the clear to the internet, blocking external communications traffic that claims to be sourced from within the organization, restricting requests to the internet that are not from the internal web proxy server, and limiting CUI transfers between organizations based on data structures and content. Transferring CUI between organizations may require an agreement that specifies how the information flow is enforced (see <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.12.05\">03.12.05</a>). Transferring CUI between systems that represent different security domains with different security policies introduces the risk that such transfers violate one or more domain security policies. In such situations, information owners or stewards provide guidance at designated policy enforcement points between interconnected systems. Organizations consider mandating specific architectural solutions when required to enforce specific security policies. Enforcement includes prohibiting CUI transfers between interconnected systems (i.e., allowing information access only), employing hardware mechanisms to enforce one-way information flows, and implementing trustworthy regrading mechanisms to reassign security attributes and security labels. Organizations commonly use information flow control policies and enforcement mechanisms to control the flow of CUI between designated sources and destinations (e.g., networks, individuals, and devices) within systems and between interconnected systems. Flow control is based on characteristics of the information or the information path. Enforcement occurs in boundary protection devices (e.g., encrypted tunnels, routers, gateways, and firewalls) that use rule sets or establish configuration settings that restrict system services, provide a packet-filtering capability based on header information, or provide a message-filtering capability based on message content (e.g., implementing key word searches or using document characteristics). Organizations also consider the trustworthiness of filtering and inspection mechanisms (i.e., hardware, firmware, and software components) that are critical to information flow enforcement."
                            },
                            {
                                "elementIdentifier": "E-03.01.03",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; information flow control policies; procedures for information flow enforcement; security architecture and design documentation; system configuration settings; system baseline configuration; system audit records; list of information flow authorizations; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.03",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: system administrators; personnel with security architecture responsibilities; personnel with information security responsibilities; system developers]"
                            },
                            {
                                "elementIdentifier": "SP 800-160-1",
                                "elementTypeIdentifier": "reference",
                                "title": "Ross R, Winstead M, McEvilley M (2022) Engineering Trustworthy Secure Systems. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-160, Vol. 1, Rev. 1",
                                "text": "https://doi.org/10.6028/NIST.SP.800-160v1r1"
                            },
                            {
                                "elementIdentifier": "SP 800-162",
                                "elementTypeIdentifier": "reference",
                                "title": "Hu VC, Ferraiolo DF, Kuhn R, Schnitzer A, Sandlin K, Miller R, Scarfone KA (2014) Guide to Attribute Based Access Control (ABAC) Definition and Considerations. (National Institute of Standards and Tec",
                                "text": "https://doi.org/10.6028/NIST.SP.800-162"
                            },
                            {
                                "elementIdentifier": "SP 800-178",
                                "elementTypeIdentifier": "reference",
                                "title": "Ferraiolo DF, Hu VC, Kuhn R, Chandramouli R (2016) A Comparison of Attribute Based Access Control (ABAC) Standards for Data Service Applications: Extensible Access Control Markup Language (XACML) and ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-178"
                            },
                            {
                                "elementIdentifier": "SR-03.01.03",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Enforce approved authorizations for controlling the flow of CUI within the system and between connected systems.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.01.03[01]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "approved authorizations are enforced for controlling the flow of CUI within the system."
                                    },
                                    {
                                        "elementIdentifier": "DS-A.03.01.03[02]",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "approved authorizations are enforced for controlling the flow of CUI between connected systems."
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.03",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing the information flow enforcement policy]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.3",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 198999,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-04",
                                "elementTypeIdentifier": "control",
                                "child_title": "INFORMATION FLOW ENFORCEMENT",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.04",
                        "elementTypeIdentifier": "requirement",
                        "title": "Separation of Duties",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.04",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Separation of duties addresses the potential for abuse of authorized privileges and reduces the risk of malevolent activity without collusion. Separation of duties includes dividing mission functions and support functions among different individuals or roles, conducting system support functions with different individuals or roles (e.g., quality assurance, configuration management, network security, system management, assessments, and programming), and ensuring that personnel who administer access control functions do not also administer audit functions. Because separation of duty violations can span systems and application domains, organizations consider the entirety of their systems and system components when developing policies on separation of duties. This requirement is enforced by <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.01.02\">03.01.02</a>."
                            },
                            {
                                "elementIdentifier": "E-03.01.04",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for the separation of duties and the division of responsibilities; system configuration settings; system audit records; system access authorizations; list of divisions of responsibility and separation of duties; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.04",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with responsibilities for defining the separation of duties and the division of responsibilities; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-162",
                                "elementTypeIdentifier": "reference",
                                "title": "Hu VC, Ferraiolo DF, Kuhn R, Schnitzer A, Sandlin K, Miller R, Scarfone KA (2014) Guide to Attribute Based Access Control (ABAC) Definition and Considerations. (National Institute of Standards and Tec",
                                "text": "https://doi.org/10.6028/NIST.SP.800-162"
                            },
                            {
                                "elementIdentifier": "SP 800-178",
                                "elementTypeIdentifier": "reference",
                                "title": "Ferraiolo DF, Hu VC, Kuhn R, Chandramouli R (2016) A Comparison of Attribute Based Access Control (ABAC) Standards for Data Service Applications: Extensible Access Control Markup Language (XACML) and ",
                                "text": "https://doi.org/10.6028/NIST.SP.800-178"
                            },
                            {
                                "elementIdentifier": "SR-03.01.04",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.04.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Identify the duties of individuals requiring separation.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.04.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "duties of individuals requiring separation are identified."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.04.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b ",
                                        "text": "Define system access authorizations to support separation of duties.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.04.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system access authorizations to support separation of duties are defined."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.04",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing the separation of duties policy]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.4",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199000,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-05",
                                "elementTypeIdentifier": "control",
                                "child_title": "SEPARATION OF DUTIES",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.05",
                        "elementTypeIdentifier": "requirement",
                        "title": "Least Privilege",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.05",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Organizations employ the principle of least privilege for specific duties and authorized access for users and system processes. Least privilege is applied to the development, implementation, and operation of the system. Organizations consider creating additional processes, roles, and system accounts to achieve least privilege. Security functions include establishing system accounts and assigning privileges, installing software, configuring access authorizations, configuring settings for events to be audited, establishing vulnerability scanning parameters, establishing intrusion detection parameters, and managing audit information. Security-relevant information includes threat and vulnerability information, filtering rules for routers or firewalls, configuration parameters for security services, security architecture, cryptographic key management information, access control lists, and audit information."
                            },
                            {
                                "elementIdentifier": "E-03.01.05",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for least privilege; list of assigned access authorizations (i.e., privileges); system configuration settings; system audit records; list of security functions (implemented in hardware, software, and firmware); security-relevant information for which access must be explicitly authorized; list of system-generated roles or classes of users and assigned privileges; validation reviews of privileges assigned to roles or classes of users; records of privilege removals or reassignments for roles or classes of users; system security plan; system design documentation; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.05",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with responsibilities for defining least privileges; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SR-03.01.05",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.05.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Allow only authorized system access for users (or processes acting on behalf of users) that is necessary to accomplish assigned organizational tasks.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.05.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "system access for users (or processes acting on behalf of users) is authorized only when necessary to accomplish assigned organizational tasks."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.05.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Authorize access to [Assignment: organization-defined security functions] and [Assignment: organization-defined security-relevant information].",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.05.b[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "access to <A.03.01.05.ODP[01]: security functions> is authorized.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.05.ODP[01]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "security functions",
                                                        "text": "security functions for authorized access are defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.05.odp[01]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined security functions"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.05.b[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "access to <A.03.01.05.ODP[02]: security-relevant information> is authorized.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.05.ODP[02]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "security-relevant information",
                                                        "text": "security-relevant information for authorized access is defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.05.odp[02]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined security-relevant information"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.05.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Review the privileges assigned to roles or classes of users [Assignment: organization-defined frequency] to validate the need for such privileges.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.05.c",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the privileges assigned to roles or classes of users are reviewed <A.03.01.05.ODP[03]: frequency> to validate the need for such privileges.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.05.ODP[03]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "frequency",
                                                        "text": "the frequency at which to review the privileges assigned to roles or classes of users is defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.05.odp[03]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined frequency"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.05.d",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "d",
                                        "text": "Reassign or remove privileges, as necessary.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.05.d",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "privileges are reassigned or removed, as necessary."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.05",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing least privilege functions; mechanisms for implementing reviews of user privileges]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.5",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199001,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-06",
                                "elementTypeIdentifier": "control",
                                "child_title": "LEAST PRIVILEGE",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-06(01)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "AUTHORIZE ACCESS TO SECURITY FUNCTIONS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-06(07)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "REVIEW OF USER PRIVILEGES",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AU-09(04)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "ACCESS BY SUBSET OF PRIVILEGED USERS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.06",
                        "elementTypeIdentifier": "requirement",
                        "title": "Least Privilege – Privileged Accounts",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.06",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Privileged accounts refer to accounts that are granted elevated privileges to access resources (including security functions or security-relevant information) that are otherwise restricted for non-privileged accounts. These accounts are typically described as system administrator or super user accounts. For example, a privileged account is often required in order to perform privileged functions such as executing commands that could modify system behavior. Restricting privileged accounts to specific personnel or roles ensures that only those authorized users can access and manipulate security functions or security-relevant information. Requiring the use of non-privileged accounts when such access is not needed can limit unauthorized access to and manipulation of security functions or security-relevant information."
                            },
                            {
                                "elementIdentifier": "E-03.01.06",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for least privilege; list of system-generated privileged accounts; list of system administration personnel; system audit records; system configuration settings; system security plan; list of system-generated security functions or security-relevant information assigned to system accounts or roles; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.06",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with responsibilities for defining least privileges; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SR-03.01.06",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.06.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Restrict privileged accounts on the system to [Assignment: organization-defined personnel or roles]..",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.06.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "privileged accounts on the system are restricted to <A.03.01.06.ODP[01]: personnel or roles>.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.06.ODP[01]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "personnel or roles",
                                                        "text": "personnel or roles to which privileged accounts on the system are to be restricted are defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.06.odp[01]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined personnel or roles"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.06.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Require that users (or roles) with privileged accounts use non-privileged accounts when accessing non-security functions or non-security information.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.06.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "users (or roles) with privileged accounts are required to use non-privileged accounts when accessing non-security functions or non-security information."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.06",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing least privilege functions]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.6",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199002,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-06(02)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "NON-PRIVILEGED ACCESS FOR NONSECURITY FUNCTIONS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-06(05)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "PRIVILEGED ACCOUNTS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.07",
                        "elementTypeIdentifier": "requirement",
                        "title": "Least Privilege – Privileged Functions",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.07",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Privileged functions include establishing system accounts, performing system integrity checks, conducting patching operations, changing system configuration settings, or administering cryptographic key management activities. Non-privileged users do not possess the authorizations to execute privileged functions. Bypassing intrusion detection and prevention mechanisms or malicious code protection mechanisms are examples of privileged functions that require protection from non-privileged users. This requirement represents a condition achieved by the definition of authorized privileges in <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.01.01\">03.01.01</a> and privilege enforcement in <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.01.02\">03.01.02</a>. The misuse of privileged functions — whether intentionally or unintentionally by authorized users or by unauthorized external entities that have compromised system accounts — is a serious and ongoing concern that can have significant adverse impacts on organizations. Logging the use of privileged functions is one way to detect such misuse and mitigate risks from advanced persistent threats and insider threats."
                            },
                            {
                                "elementIdentifier": "E-03.01.07",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for least privilege; system design documentation; system configuration settings; system audit records; list of audited events; list of privileged functions to be audited and associated user account assignments; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.07",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with responsibilities for reviewing least privileges; personnel with information security responsibilities; system developers; system administrators]"
                            },
                            {
                                "elementIdentifier": "SR-03.01.07",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.07.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Prevent non-privileged users from executing privileged functions.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.07.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "non-privileged users are prevented from executing privileged functions."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.07.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Log the execution of privileged functions.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.07.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the execution of privileged functions is logged."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.07",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for auditing the execution of least privilege functions; mechanisms for implementing least privilege functions for non-privileged users]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.7",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199003,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-06(09)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "LOG USE OF PRIVILEGED FUNCTIONS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-06(10)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "PROHIBIT NON-PRIVILEGED USERS FROM EXECUTING PRIVILEGED FUNCTIONS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.08",
                        "elementTypeIdentifier": "requirement",
                        "title": "Unsuccessful Logon Attempts",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.08",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Due to the potential for denial of service, automatic system lockouts are in most cases, temporary and automatically release after a predetermined time period established by the organization (i.e., using a delay algorithm). Organizations may employ different delay algorithms for different system components based on the capabilities of the respective components. Responses to unsuccessful system logon attempts may be implemented at the system and application levels. Organization-defined actions that may be taken include prompting the user to answer a secret question in addition to the username and password, invoking a lockdown mode with limited user capabilities (instead of a full lockout), allowing users to only logon from specified Internet Protocol (IP) addresses, requiring a CAPTCHA to prevent automated attacks, or applying user profiles, such as location, time of day, IP address, device, or Media Access Control (MAC) address."
                            },
                            {
                                "elementIdentifier": "E-03.01.08",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for unsuccessful logon attempts; system design documentation; system audit records; system configuration settings; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.08",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with information security responsibilities; system developers; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-124",
                                "elementTypeIdentifier": "reference",
                                "title": "Howell G, Franklin JM, Sritapan V, Souppaya M, Scarfone K (2023) Guidelines for Managing the Security of Mobile Devices in the Enterprise. (National Institute of Standards and Technology, Gaithersburg",
                                "text": "https://doi.org/10.6028/NIST.SP.800-124r2"
                            },
                            {
                                "elementIdentifier": "SP 800-63-3",
                                "elementTypeIdentifier": "reference",
                                "title": "Grassi PA, Garcia ME, Fenton JL (2017) Digital Identity Guidelines. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-63-3, Includes updates as of M",
                                "text": "https://doi.org/10.6028/NIST.SP.800-63-3"
                            },
                            {
                                "elementIdentifier": "SR-03.01.08",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.08.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Enforce a limit of [Assignment: organization-defined number] consecutive invalid logon attempts by a user during a [Assignment: organization-defined time period].",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.08.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "a limit of <A.03.01.08.ODP[01]: number> consecutive invalid logon attempts by a user during <A.03.01.08.ODP[02]: time period> is enforced.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.08.ODP[01]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "number",
                                                        "text": "the number of consecutive invalid logon attempts by a user allowed during a time period is defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.08.odp[01]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined number"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "elementIdentifier": "A.03.01.08.ODP[02]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "time period",
                                                        "text": "the time period to which the number of consecutive invalid logon attempts by a user is limited is defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.08.odp[02]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined time period"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.08.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Automatically [Selection (one or more): lock the account or node for an [Assignment: organization-defined time period]; lock the account or node until released by an administrator; delay next logon prompt; notify system administrator; take other action] when the maximum number of unsuccessful attempts is exceeded.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.08.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "<A.03.01.08.ODP[03]: SELECTED PARAMETER VALUES> when the maximum number of unsuccessful attempts is exceeded.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.08.ODP[03]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "SELECTED PARAMETER VALUES",
                                                        "text": "one or more of the following PARAMETER VALUES are selected: {the account or node is locked automatically for <A.03.01.08.ODP[04]: time period>; the account or node is locked automatically until released by an administrator; the next logon prompt is delayed automatically; the system administrator is notified automatically; other action is taken automatically}.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "A.03.01.08.ODP[04]",
                                                                "elementTypeIdentifier": "odp",
                                                                "title": "",
                                                                "text": "the time period for an account or node to be locked is defined (if selected).",
                                                                "elements": [
                                                                    {
                                                                        "elementIdentifier": "OS-a.03.01.08.odp[04]",
                                                                        "elementTypeIdentifier": "odp_statement",
                                                                        "title": "",
                                                                        "text": "organization-defined time period"
                                                                    },
                                                                    {
                                                                        "elementIdentifier": "single_entry",
                                                                        "elementTypeIdentifier": "odp_type",
                                                                        "title": "Assignment",
                                                                        "text": ""
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "elementIdentifier": "multi_select",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Selection (one or more)",
                                                                "text": ""
                                                            },
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.08.odp[03]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "lock the account or node for an [Assignment: organization-defined time period]; lock the account or node until released by an administrator; delay next logon prompt; notify system administrator; take other action"
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.08",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing the access control policy for unsuccessful logon attempts]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.8",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199004,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-07",
                                "elementTypeIdentifier": "control",
                                "child_title": "UNSUCCESSFUL LOGON ATTEMPTS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.09",
                        "elementTypeIdentifier": "requirement",
                        "title": "System Use Notification",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.09",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "System use notifications can be implemented using messages or warning banners. The messages or warning banners are displayed before individuals log in to a system that processes, stores, or transmits CUI. System use notifications are used for access via logon interfaces with human users and are not required when human interfaces do not exist. Organizations consider whether a secondary use notification is needed to access applications or other system resources after the initial network logon. Posters or other printed materials may be used in lieu of an automated system message. This requirement is related to <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.15.03\">03.15.03</a>."
                            },
                            {
                                "elementIdentifier": "E-03.01.09",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; privacy and security policies, procedures for system use notification; documented approval of system use notification messages; system audit records; user acknowledgements of system use notification messages; system design documentation; system configuration settings; system use notification messages; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.09",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with information security responsibilities; legal counsel; system developers; system administrators]"
                            },
                            {
                                "elementIdentifier": "SR-03.01.09",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Display a system use notification message with privacy and security notices consistent with applicable CUI rules before granting access to the system.",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.01.09",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "a system use notification message with privacy and security notices consistent with applicable CUI rules is displayed before granting access to the system."
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.09",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing system use notifications]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.9",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199005,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-08",
                                "elementTypeIdentifier": "control",
                                "child_title": "SYSTEM USE NOTIFICATION",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.10",
                        "elementTypeIdentifier": "requirement",
                        "title": "Device Lock",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.10",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Device locks are temporary actions taken to prevent access to the system when users depart from the immediate vicinity of the system but do not want to log out due to the temporary nature of their absences. Device locks can be implemented at the operating system level or application level. User-initiated device locking is behavior- or policy-based and requires users to take physical action to initiate the device lock. Device locks are not an acceptable substitute for logging out of the system (e.g., when organizations require users to log out at the end of workdays). Publicly viewable images can include static or dynamic images, such as patterns used with screen savers, solid colors, photographic images, a clock, a battery life indicator, or a blank screen with the caveat that controlled unclassified information is not displayed."
                            },
                            {
                                "elementIdentifier": "E-03.01.10",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for session lock and identification and authentication; system design documentation; system configuration settings; display screen with session lock activated; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.10",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with information security responsibilities; system developers; system administrators]"
                            },
                            {
                                "elementIdentifier": "SR-03.01.10",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.10.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Prevent access to the system by [Selection (one or more): initiating a device lock after [Assignment: organization-defined time period] of inactivity; requiring the user to initiate a device lock before leaving the system unattended].",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.10.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "access to the system is prevented by <A.03.01.10.ODP[01]: SELECTED PARAMETER VALUES>.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.10.ODP[01]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "SELECTED PARAMETER VALUES",
                                                        "text": "one or more of the following PARAMETER VALUES are selected: {a device lock is initiated after <A.03.01.10.ODP[02]: time period> of inactivity; the user is required to initiate a device lock before leaving the system unattended}.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "A.03.01.10.ODP[02]",
                                                                "elementTypeIdentifier": "odp",
                                                                "title": "",
                                                                "text": "the time period of inactivity after which a device lock is initiated is defined (if selected).",
                                                                "elements": [
                                                                    {
                                                                        "elementIdentifier": "OS-a.03.01.10.odp[02]",
                                                                        "elementTypeIdentifier": "odp_statement",
                                                                        "title": "",
                                                                        "text": "organization-defined time period"
                                                                    },
                                                                    {
                                                                        "elementIdentifier": "single_entry",
                                                                        "elementTypeIdentifier": "odp_type",
                                                                        "title": "Assignment",
                                                                        "text": ""
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "elementIdentifier": "multi_select",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Selection (one or more)",
                                                                "text": ""
                                                            },
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.10.odp[01]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "initiating a device lock after [Assignment: organization-defined time period] of inactivity; requiring the user to initiate a device lock before leaving the system unattended"
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.10.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Retain the device lock until the user reestablishes access using established identification and authentication procedures.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.10.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the device lock is retained until the user reestablishes access using established identification and authentication procedures."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.10.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Conceal, via the device lock, information previously visible on the display with a publicly viewable image.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.10.c",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "information previously visible on the display is concealed via device lock with a publicly viewable image."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.10",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing the access control policy for session lock; session lock mechanisms]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.10",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199006,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-11",
                                "elementTypeIdentifier": "control",
                                "child_title": "DEVICE LOCK",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-11(01)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "PATTERN-HIDING DISPLAYS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.11",
                        "elementTypeIdentifier": "requirement",
                        "title": "Session Termination",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.11",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "This requirement addresses the termination of user-initiated logical sessions in contrast to the termination of network connections that are associated with communications sessions (i.e., disconnecting from the network) in <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.13.09\">03.13.09</a>. A logical session is initiated whenever a user (or processes acting on behalf of a user) accesses a system. Logical sessions can be terminated (and thus terminate user access) without terminating network sessions. Session termination ends all system processes associated with a user’s logical session except those processes that are created by the user (i.e., session owner) to continue after the session is terminated. Conditions or trigger events that require automatic session termination can include organization-defined periods of user inactivity, time-of-day restrictions on system use, and targeted responses to certain types of incidents."
                            },
                            {
                                "elementIdentifier": "E-03.01.11",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for session termination; system design documentation; system configuration settings; list of conditions or trigger events requiring session disconnect; system audit records; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.11",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with information security responsibilities; system developers; system administrators]"
                            },
                            {
                                "elementIdentifier": "SR-03.01.11",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "Terminate a user session automatically after [Assignment: organization-defined conditions or trigger events requiring session disconnect].",
                                "elements": [
                                    {
                                        "elementIdentifier": "DS-A.03.01.11",
                                        "elementTypeIdentifier": "determination",
                                        "title": "",
                                        "text": "a user session is terminated automatically after <A.03.01.11.ODP[01]: conditions or trigger events>.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "A.03.01.11.ODP[01]",
                                                "elementTypeIdentifier": "odp",
                                                "title": "conditions or trigger events",
                                                "text": "conditions or trigger events that require session disconnect are defined.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "OS-a.03.01.11.odp[01]",
                                                        "elementTypeIdentifier": "odp_statement",
                                                        "title": "",
                                                        "text": "organization-defined conditions or trigger events requiring session disconnect"
                                                    },
                                                    {
                                                        "elementIdentifier": "single_entry",
                                                        "elementTypeIdentifier": "odp_type",
                                                        "title": "Assignment",
                                                        "text": ""
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.11",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: automated mechanisms for implementing user session termination]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.11",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199007,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-12",
                                "elementTypeIdentifier": "control",
                                "child_title": "SESSION TERMINATION",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.12",
                        "elementTypeIdentifier": "requirement",
                        "title": "Remote Access",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.12",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Remote access is access to systems (or processes acting on behalf of users) that communicate through external networks, such as the internet. Monitoring and controlling remote access methods allows organizations to detect attacks and ensure compliance with remote access policies. Routing remote access through managed access control points enhances explicit control over such connections and reduces susceptibility to unauthorized access to the system, which could result in the unauthorized disclosure of CUI. Remote access to the system represents a significant potential vulnerability that can be exploited by adversaries. Restricting the execution of privileged commands and access to security-relevant information via remote access reduces the exposure of the organization and its susceptibility to threats by adversaries. A privileged command is a human-initiated command executed on a system that involves the control, monitoring, or administration of the system, including security functions and security-relevant information. Security-relevant information is information that can potentially impact the operation of security functions or the provision of security services in a manner that could result in failure to enforce the system security policy or maintain isolation of code and data. Privileged commands give individuals the ability to execute sensitive, security-critical, or security-relevant system functions."
                            },
                            {
                                "elementIdentifier": "E-03.01.12",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for remote system access; remote system access configuration and connection requirements; configuration management plan; system configuration settings; remote access authorizations; system audit records; system design documentation; procedures for remote access to the system; system monitoring records; list of managed network access control points; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.12",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with responsibilities for managing remote access connections; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "IR 7966",
                                "elementTypeIdentifier": "reference",
                                "title": "Ylonen T, Turner P, Scarfone KA, Souppaya MP (2015) Security of Interactive and Automated Access Management Using Secure Shell (SSH). (National Institute of Standards and Technology, Gaithersburg, MD)",
                                "text": "https://doi.org/10.6028/NIST.IR.7966"
                            },
                            {
                                "elementIdentifier": "SP 800-113",
                                "elementTypeIdentifier": "reference",
                                "title": "Frankel SE, Hoffman P, Orebaugh AD, Park R (2008) Guide to SSL VPNs. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-113.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-113"
                            },
                            {
                                "elementIdentifier": "SP 800-114",
                                "elementTypeIdentifier": "reference",
                                "title": "Souppaya MP, Scarfone KA (2016) User’s Guide to Telework and Bring Your Own Device (BYOD) Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 80",
                                "text": "https://doi.org/10.6028/NIST.SP.800-114r1"
                            },
                            {
                                "elementIdentifier": "SP 800-121",
                                "elementTypeIdentifier": "reference",
                                "title": "Padgette J, Bahr J, Holtmann M, Batra M, Chen L, Smithbey R, Scarfone KA (2017) Guide to Bluetooth Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publicatio",
                                "text": "https://doi.org/10.6028/NIST.SP.800-121r2-upd1"
                            },
                            {
                                "elementIdentifier": "SP 800-46",
                                "elementTypeIdentifier": "reference",
                                "title": "Souppaya MP, Scarfone KA (2016) Guide to Enterprise Telework, Remote Access, and Bring Your Own Device (BYOD) Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special",
                                "text": "https://doi.org/10.6028/NIST.SP.800-46r2"
                            },
                            {
                                "elementIdentifier": "SP 800-77",
                                "elementTypeIdentifier": "reference",
                                "title": "Barker EB, Dang QH, Frankel SE, Scarfone KA, Wouters P (2020) Guide to IPsec VPNs. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-77, Rev. 1.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-77r1"
                            },
                            {
                                "elementIdentifier": "SR-03.01.12",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.12.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Establish usage restrictions, configuration requirements, and connection requirements for each type of allowable remote system access.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.a[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "types of allowable remote system access are defined."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.a[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "usage restrictions are established for each type of allowable remote system access."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.a[03]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "configuration requirements are established for each type of allowable remote system access."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.a[04]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "connection requirements are established for each type of allowable remote system access."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.12.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Authorize each type of remote system access prior to establishing such connections.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "each type of remote system access is authorized prior to establishing such connections."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.12.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Route remote access to the system through authorized and managed access control points.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.c[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "remote access to the system is routed through authorized access control points."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.c[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "remote access to the system is routed through managed access control points."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.12.d",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "d",
                                        "text": "Authorize the remote execution of privileged commands and remote access to security-relevant information.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.d[1]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "remote execution of privileged commands is authorized."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.12.d[2]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "remote access to security-relevant information is authorized."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.12",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for monitoring and controlling remote access methods; mechanisms for routing remote accesses through managed access control points; remote access management capability for the system]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.12",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199008,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-17",
                                "elementTypeIdentifier": "control",
                                "child_title": "REMOTE ACCESS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-17(03)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "MANAGED ACCESS CONTROL POINTS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-17(04)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "PRIVILEGED COMMANDS AND ACCESS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.13",
                        "elementTypeIdentifier": "requirement",
                        "title": "",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "WR-03.01.13",
                                "elementTypeIdentifier": "withdraw_reason",
                                "title": "",
                                "text": "Addressed by 03.13.08.",
                                "elements": [
                                    {
                                        "elementIdentifier": "03.13.08",
                                        "elementTypeIdentifier": "requirement",
                                        "title": "Transmission and Storage Confidentiality",
                                        "text": "",
                                        "relationIdentifier": "addressed_by"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.14",
                        "elementTypeIdentifier": "requirement",
                        "title": "",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "WR-03.01.14",
                                "elementTypeIdentifier": "withdraw_reason",
                                "title": "",
                                "text": "Incorporated into 03.01.12.",
                                "elements": [
                                    {
                                        "elementIdentifier": "03.01.12",
                                        "elementTypeIdentifier": "requirement",
                                        "title": "Remote Access",
                                        "text": "",
                                        "relationIdentifier": "incorporated_into"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.15",
                        "elementTypeIdentifier": "requirement",
                        "title": "",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "WR-03.01.15",
                                "elementTypeIdentifier": "withdraw_reason",
                                "title": "",
                                "text": "Incorporated into 03.01.12.",
                                "elements": [
                                    {
                                        "elementIdentifier": "03.01.12",
                                        "elementTypeIdentifier": "requirement",
                                        "title": "Remote Access",
                                        "text": "",
                                        "relationIdentifier": "incorporated_into"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.16",
                        "elementTypeIdentifier": "requirement",
                        "title": "Wireless Access",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.16",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "Wireless networking capabilities represent a significant potential vulnerability that can be exploited by adversaries. Establishing usage restrictions, configuration requirements, and connection requirements for wireless access to the system provides criteria to support access authorization decisions. These restrictions and requirements reduce susceptibility to unauthorized system access through wireless technologies. Wireless networks use authentication protocols that provide credential protection and mutual authentication. Organizations authenticate individuals and devices to protect wireless access to the system. Special attention is given to the variety of devices with potential wireless access to the system, including small form factor mobile devices (e.g., smart phones, tablets, smart watches). Wireless networking capabilities that are embedded within system components represent a potential vulnerability that can be exploited by adversaries. Strong authentication of users and devices, strong encryption, and disabling wireless capabilities that are not needed for essential mission or business functions can reduce susceptibility to threats by adversaries involving wireless technologies."
                            },
                            {
                                "elementIdentifier": "E-03.01.16",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for wireless system access; wireless system access configuration and connection requirements; configuration management plan; system configuration settings; wireless access authorizations; system audit records; system design documentation; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.16",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with responsibilities for managing wireless access connections; personnel with information security responsibilities; system developers; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-124",
                                "elementTypeIdentifier": "reference",
                                "title": "Howell G, Franklin JM, Sritapan V, Souppaya M, Scarfone K (2023) Guidelines for Managing the Security of Mobile Devices in the Enterprise. (National Institute of Standards and Technology, Gaithersburg",
                                "text": "https://doi.org/10.6028/NIST.SP.800-124r2"
                            },
                            {
                                "elementIdentifier": "SP 800-94",
                                "elementTypeIdentifier": "reference",
                                "title": "Scarfone KA, Mell PM (2007) Guide to Intrusion Detection and Prevention Systems (IDPS). (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 800-94.",
                                "text": "https://doi.org/10.6028/NIST.SP.800-94"
                            },
                            {
                                "elementIdentifier": "SP 800-97",
                                "elementTypeIdentifier": "reference",
                                "title": "Frankel SE, Eydt B, Owens L, Scarfone KA (2007) Establishing Wireless Robust Security Networks: A Guide to IEEE 802.11i. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Specia",
                                "text": "https://doi.org/10.6028/NIST.SP.800-97"
                            },
                            {
                                "elementIdentifier": "SR-03.01.16",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.16.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Establish usage restrictions, configuration requirements, and connection requirements for each type of wireless access to the system.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.16.a[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "each type of wireless access to the system is defined."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.16.a[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "usage restrictions are established for each type of wireless access to the system."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.16.a[03]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "configuration requirements are established for each type of wireless access to the system."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.16.a[04]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "connection requirements are established for each type of wireless access to the system."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.16.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Authorize each type of wireless access to the system prior to establishing such connections.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.16.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "each type of wireless access to the system is authorized prior to establishing such connections."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.16.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Disable, when not intended for use, wireless networking capabilities prior to issuance and deployment.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.16.c",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "wireless networking capabilities not intended for use are disabled prior to issuance and deployment."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.16.d",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "d",
                                        "text": "Protect wireless access to the system using authentication and encryption.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.16.d[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "wireless access to the system is protected using authentication."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.16.d[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "wireless access to the system is protected using encryption."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.16",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: wireless access management capability for the system; mechanisms for implementing wireless access protections to the system; mechanisms for managing the disabling of wireless networking capabilities]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.16",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199009,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-18",
                                "elementTypeIdentifier": "control",
                                "child_title": "WIRELESS ACCESS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-18(01)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "AUTHENTICATION AND ENCRYPTION",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-18(03)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "DISABLE WIRELESS NETWORKING",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.17",
                        "elementTypeIdentifier": "requirement",
                        "title": "",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "WR-03.01.17",
                                "elementTypeIdentifier": "withdraw_reason",
                                "title": "",
                                "text": "Incorporated into 03.01.16.",
                                "elements": [
                                    {
                                        "elementIdentifier": "03.01.16",
                                        "elementTypeIdentifier": "requirement",
                                        "title": "Wireless Access",
                                        "text": "",
                                        "relationIdentifier": "incorporated_into"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.18",
                        "elementTypeIdentifier": "requirement",
                        "title": "Access Control for Mobile Devices",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.18",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "A mobile device is a computing device with a small form factor such that it can be carried by a single individual; is designed to operate without a physical connection; possesses local, non-removable, or removable data storage; and includes a self-contained power source. Mobile device functionality may include on-board sensors that allow the device to capture information, voice communication capabilities, and/or built-in features for synchronizing local data with remote locations. Examples include smart phones, smart watches, and tablets. Mobile devices are typically associated with a single individual. The processing, storage, and transmission capabilities of mobile devices may be comparable to or a subset of notebook or desktop systems, depending on the nature and intended purpose of the device. Some organizations may consider notebook computers to be mobile devices. The protection and control of mobile devices are behavior- or policy-based and require users to take physical action to protect and control such devices when outside of controlled areas. Controlled areas are spaces for which the organization provides physical or procedural controls to meet the requirements established for protecting CUI. Due to the large variety of mobile devices with different characteristics and capabilities, organizational restrictions may vary for the different classes or types of such devices. Usage restrictions, configuration requirements, and connection requirements for mobile devices include configuration management, device identification and authentication, implementing mandatory protective software, scanning devices for malicious code, updating virus protection software, scanning for critical software updates and patches, conducting operating system and possibly other software integrity checks, and disabling unnecessary hardware. On mobile devices, secure containers provide software-based data isolation designed to segment enterprise applications and information from personal apps and data. Containers may present multiple user interfaces, one of the most common being a mobile application that acts as a portal to a suite of business productivity apps, such as email, contacts, and calendar. Organizations can employ full-device encryption or container-based encryption to protect the confidentiality of CUI on mobile devices."
                            },
                            {
                                "elementIdentifier": "E-03.01.18",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for mobile device access control; system design documentation; configuration management plan; system configuration settings; authorizations for mobile device connections to organizational systems; system audit records; encryption mechanisms and associated configuration documentation; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.18",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with access control responsibilities for mobile devices; personnel using mobile devices to access organizational systems; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SP 800-114",
                                "elementTypeIdentifier": "reference",
                                "title": "Souppaya MP, Scarfone KA (2016) User’s Guide to Telework and Bring Your Own Device (BYOD) Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special Publication (SP) 80",
                                "text": "https://doi.org/10.6028/NIST.SP.800-114r1"
                            },
                            {
                                "elementIdentifier": "SP 800-124",
                                "elementTypeIdentifier": "reference",
                                "title": "Howell G, Franklin JM, Sritapan V, Souppaya M, Scarfone K (2023) Guidelines for Managing the Security of Mobile Devices in the Enterprise. (National Institute of Standards and Technology, Gaithersburg",
                                "text": "https://doi.org/10.6028/NIST.SP.800-124r2"
                            },
                            {
                                "elementIdentifier": "SP 800-46",
                                "elementTypeIdentifier": "reference",
                                "title": "Souppaya MP, Scarfone KA (2016) Guide to Enterprise Telework, Remote Access, and Bring Your Own Device (BYOD) Security. (National Institute of Standards and Technology, Gaithersburg, MD), NIST Special",
                                "text": "https://doi.org/10.6028/NIST.SP.800-46r2"
                            },
                            {
                                "elementIdentifier": "SR-03.01.18",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.18.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Establish usage restrictions, configuration requirements, and connection requirements for mobile devices.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.18.a[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "usage restrictions are established for mobile devices."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.18.a[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "configuration requirements are established for mobile devices."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.18.a[03]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "connection requirements are established for mobile devices."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.18.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Authorize the connection of mobile devices to the system.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.18.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the connection of mobile devices to the system is authorized."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.18.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Implement full-device or container-based encryption to protect the confidentiality of CUI on mobile devices.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.18.c",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "full-device or container-based encryption is implemented to protect the confidentiality of CUI on mobile devices."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.18",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: access control capability for mobile device connections to organizational systems; encryption mechanisms for protecting the confidentiality of CUI on mobile devices; configurations of mobile devices]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.18",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199010,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-19",
                                "elementTypeIdentifier": "control",
                                "child_title": "ACCESS CONTROL FOR MOBILE DEVICES",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-19(05)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "FULL DEVICE OR CONTAINER-BASED ENCRYPTION",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.19",
                        "elementTypeIdentifier": "requirement",
                        "title": "",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "WR-03.01.19",
                                "elementTypeIdentifier": "withdraw_reason",
                                "title": "",
                                "text": "Incorporated into 03.01.18.",
                                "elements": [
                                    {
                                        "elementIdentifier": "03.01.18",
                                        "elementTypeIdentifier": "requirement",
                                        "title": "Access Control for Mobile Devices",
                                        "text": "",
                                        "relationIdentifier": "incorporated_into"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.20",
                        "elementTypeIdentifier": "requirement",
                        "title": "Use of External Systems",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.20",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "External systems are systems that are used by but are not part of the organization. These systems include personally owned systems, system components, or devices; privately owned computing and communication devices in commercial or public facilities; systems owned or controlled by nonfederal organizations; and systems managed by contractors. Organizations have the option to prohibit the use of any type of external system or specified types of external systems (e.g., prohibit the use of external systems that are not organizationally owned). Terms and conditions are consistent with the trust relationships established with the entities that own, operate, or maintain external systems and include descriptions of shared responsibilities. Authorized individuals include organizational personnel, contractors, or other individuals with authorized access to the organizational system and over whom organizations have the authority to impose specific rules of behavior regarding system access. Restrictions that organizations impose on authorized individuals may vary depending on the trust relationships between organizations. Organizations need assurance that external systems satisfy the necessary security requirements so as not to compromise, damage, or harm the system. This requirement is related to <a href=\"#/cprt/framework/version/SP_800_171_3_0_0/home?element=03.16.03\">03.16.03</a>."
                            },
                            {
                                "elementIdentifier": "E-03.01.20",
                                "elementTypeIdentifier": "examine",
                                "title": "",
                                "text": "[SELECT FROM: access control policy and procedures; procedures for the use of external systems; terms and conditions for the use of external systems; external systems security requirements; list of types of applications accessible from external systems; system configuration settings; system security plan; other relevant documents or records]"
                            },
                            {
                                "elementIdentifier": "I-03.01.20",
                                "elementTypeIdentifier": "interview",
                                "title": "",
                                "text": "[SELECT FROM: personnel with responsibilities for defining terms, conditions, and security requirements for the use of external systems; personnel with information security responsibilities; system administrators]"
                            },
                            {
                                "elementIdentifier": "SR-03.01.20",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.20.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Prohibit the use of external systems unless the systems are specifically authorized.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.20.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the use of external systems is prohibited unless the systems are specifically authorized."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.20.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Establish the following security requirements to be satisfied on external systems prior to allowing use of or access to those systems by authorized individuals: [Assignment: organization-defined security requirements].",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.20.b",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the following security requirements to be satisfied on external systems prior to allowing the use of or access to those systems by authorized individuals are established: <A.03.01.20.ODP[01]: security requirements>.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "A.03.01.20.ODP[01]",
                                                        "elementTypeIdentifier": "odp",
                                                        "title": "security requirements",
                                                        "text": "security requirements to be satisfied on external systems prior to allowing the use of or access to those systems by authorized individuals are defined.",
                                                        "elements": [
                                                            {
                                                                "elementIdentifier": "OS-a.03.01.20.odp[01]",
                                                                "elementTypeIdentifier": "odp_statement",
                                                                "title": "",
                                                                "text": "organization-defined security requirements"
                                                            },
                                                            {
                                                                "elementIdentifier": "single_entry",
                                                                "elementTypeIdentifier": "odp_type",
                                                                "title": "Assignment",
                                                                "text": ""
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.20.c",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "c",
                                        "text": "Permit authorized individuals to use external systems to access the organizational system or to process, store, or transmit CUI only after:",
                                        "elements": [
                                            {
                                                "elementIdentifier": "SR-03.01.20.c.01",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "01",
                                                "text": "Verifying that the security requirements on the external systems as specified in the organization’s system security plans have been satisfied and",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.20.c.01",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "authorized individuals are permitted to use external systems to access the organizational system or to process, store, or transmit CUI only after verifying that the security requirements on the external systems as specified in the organization’s system security plans have been satisfied."
                                                    }
                                                ]
                                            },
                                            {
                                                "elementIdentifier": "SR-03.01.20.c.02",
                                                "elementTypeIdentifier": "security_requirement",
                                                "title": "02",
                                                "text": "Retaining approved system connection or processing agreements with the organizational entities hosting the external systems.",
                                                "elements": [
                                                    {
                                                        "elementIdentifier": "DS-A.03.01.20.c.02",
                                                        "elementTypeIdentifier": "determination",
                                                        "title": "",
                                                        "text": "authorized individuals are permitted to use external systems to access the organizational system or to process, store, or transmit CUI only after retaining approved system connection or processing agreements with the organizational entity hosting the external systems."
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.20.d",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "d",
                                        "text": "Restrict the use of organization-controlled portable storage devices by authorized individuals on external systems.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.20.d",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the use of organization-controlled portable storage devices by authorized individuals on external systems is restricted."
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "elementIdentifier": "T-03.01.20",
                                "elementTypeIdentifier": "test",
                                "title": "",
                                "text": "[SELECT FROM: mechanisms for implementing or enforcing terms, conditions, and security requirements for the use of external systems]"
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.20",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199011,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-20",
                                "elementTypeIdentifier": "control",
                                "child_title": "USE OF EXTERNAL SYSTEMS",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-20(01)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "LIMITS ON AUTHORIZED USE",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            },
                            {
                                "elementIdentifier": "AC-20(02)",
                                "elementTypeIdentifier": "control_enhancement",
                                "child_title": "PORTABLE STORAGE DEVICES — RESTRICTED USE",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.21",
                        "elementTypeIdentifier": "requirement",
                        "title": "",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "WR-03.01.21",
                                "elementTypeIdentifier": "withdraw_reason",
                                "title": "",
                                "text": "Incorporated into 03.01.20.",
                                "elements": [
                                    {
                                        "elementIdentifier": "03.01.20",
                                        "elementTypeIdentifier": "requirement",
                                        "title": "Use of External Systems",
                                        "text": "",
                                        "relationIdentifier": "incorporated_into"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "elementIdentifier": "03.01.22",
                        "elementTypeIdentifier": "requirement",
                        "title": "Publicly Accessible Content",
                        "text": "",
                        "elements": [
                            {
                                "elementIdentifier": "D-03.01.22",
                                "elementTypeIdentifier": "discussion",
                                "title": "",
                                "text": "In accordance with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidelines, the public is not authorized to have access to nonpublic information, including CUI."
                            },
                            {
                                "elementIdentifier": "SR-03.01.22",
                                "elementTypeIdentifier": "security_requirement",
                                "title": "",
                                "text": "",
                                "elements": [
                                    {
                                        "elementIdentifier": "SR-03.01.22.a",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "a",
                                        "text": "Train authorized individuals to ensure that publicly accessible information does not contain CUI.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.22.a",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "authorized individuals are trained to ensure that publicly accessible information does not contain CUI."
                                            }
                                        ]
                                    },
                                    {
                                        "elementIdentifier": "SR-03.01.22.b",
                                        "elementTypeIdentifier": "security_requirement",
                                        "title": "b",
                                        "text": "Review the content on publicly accessible systems for CUI and remove such information, if discovered.",
                                        "elements": [
                                            {
                                                "elementIdentifier": "DS-A.03.01.22.b[01]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "the content on publicly accessible systems is reviewed for CUI."
                                            },
                                            {
                                                "elementIdentifier": "DS-A.03.01.22.b[02]",
                                                "elementTypeIdentifier": "determination",
                                                "title": "",
                                                "text": "CUI is removed from publicly accessible systems, if discovered."
                                            }
                                        ]
                                    }
                                ]
                            }
                        ],
                        "externalRelationships": [
                            {
                                "elementIdentifier": "3.1.22",
                                "relationIdentifier": "olir_focal",
                                "olirEntryElementId": 199012,
                                "shortName": "SP 800-171 Rev 2",
                                "elementTypeIdentifier": "x",
                                "title": "y",
                                "text": "z",
                                "olirName": "a"
                            },
                            {
                                "elementIdentifier": "AC-22",
                                "elementTypeIdentifier": "control",
                                "child_title": "PUBLICLY ACCESSIBLE CONTENT",
                                "child_text": "",
                                "relationIdentifier": "external_reference",
                                "shortName": "SP 800-53 Rev 5.1.1",
                                "frameworkVersionIdentifier": "SP_800_53_5_1_1"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}